[UDIMs]
edt_material_object_number=Суффикс имени объекта 001,002,003 или Ground | Object 001,002,003 or Ground
ddl_material_object_number=Суффикс объекта 001,002,003 или Ground | Object 001,002,003 or Ground
edt_material_mat_number=Редкий в использовании, номер материала в названии текстуры 1,2,3,..,7 | Rare, Material number in texture name 1,2,3,..,7
edt_multimat_count=Число найденных материалов по маске в текущей папке | The number of found by mask files in the current folder	
btn_rename=Переименовать::LMB: файлы PNG в текущем каталоге::CTRL+LMB: Все типы файлов::RMB: Выбранные объекты::RMB+CTRL: Все материалы сцены::RMB+ALT: Пути к материалам выбранных объектов | Rename::LMB: PNG files in current directory::CTRL+LMB: All type of files::RMB: Selected Objects::RMB+CTRL: All scene Materials::RMB+ALT: Materials Paths of selected objects
btn_multimat_read=Проверить имена файлов в текущем каталоге и подсчитать их количество | Check filenames of files in current directory and count quantity
edt_tex_find=Найти | To Find
edt_tex_rename=Заменить | To Rename
rdo_type_mat=Standart Material (Legacy) больше подходит для Unreal Engine::Physical Material - для Autodesk FBX Viewer | Standart Material (Legacy) more suitable for Unreal Engine::Physical Material - for Autodesk FBX Viewer
btn_singlemat=LMB: Создать материал для Lowpoly модели из файлов по маске::CTRL+LMB: получить маску из названия выбранного объекта | LMB: Make Material for Lowpoly model from files by filter mask::CTRL+LMB: get mask from selected object name
btn_multimat=LMB: Создать Multimat для ВПМ из файлов по маске::CTRL+LMB: получить маску из имени выбранного объекта::RMB: Добавить MultiTile карту в слот displace 1-го Multimat материала для отображения всех текстур в редакторе развертки | LMB: Make Multimat for Highpoly model from files by filter mask::CTRL+LMB: get mask from selected object name::RMB: Add a MultiTile map to the displace slot of the 1st Multimat material to display all textures in the UVW Editor
btn_get_multimat_path=Получить путь сохраненной папки сцены и добавить указанную подпапку | Get path from currently saved scene folder and add specified subfolder
btn_get_multimat_folder=Выбрать путь в диалоговом окне стандартного выбора папки | Select path via standart selection folder dialog
btn_open_multimat_path=Открыть текущий путь и показать папку в файловом браузере | Open current path in browser and show folder
rdo_path=
edt_path_end=	
edt_multimat_path=
lbl_multimat_path=
rdo_tex=Размер текстуры, которая будет сгенерирована | Dimension of texture to be generated
btn_name_from_sel=Скопировать имя текущего выбранного объекта | Copy name of current selected object
btn_name_to_sel=Вставить название текущего выбранного объекта | Paste name of current selected object
spn_tex_udim=UDIM - номер текстуры, которая будет сгенерирована, индекс добавляется к названию текстуры | UDIM number of texture to be generated, index adds to name texture
edt_object_name=Имя, взятое из названия выбранного объекта | Name taken from selected object name
color_diffuse=Цвет заливки для заглушки Diffuse | Diffuse color
btn_color_diffuse_ral=Создать диалоговое окно выбора цвета RAL | Create RAL color selector Dialog
btn_make_tex_diffuse=LMB: Создать текстуру с помощью цвета заливки::RMB: Отобразить сохраненную текстуру | LMB: Make texture with fill color::RMB: Display saved texture
btn_open_tex_diffuse=LMB: Открыть файловый браузер, чтобы выбрать, переименовать и изменить размер текстуры::RMB: Просмотреть файл в папке | LMB: Open file browser to select, rename and resize texture::RMB: View file in folder
edt_tex_diffuse_name=Название текстуры Diffuse, сгенерированное из названия объекта | Diffuse texture name generated from object name
color_erm=Цвет заливки для заглушки ERM, R-излучение (0 нет света); G-шероховатость (0 глянцевая, 255 матовая); B-металличность (0 без отражения, 255 зеркало) | R-emission (0 no light); G-rougness (0 gloss, 255 matt); B-metallness (0 no reflect, 255 mirror)
btn_make_tex_erm=LMB: Создать текстуру с помощью цвета заливки::RMB: Отобразить сохраненную текстуру | LMB: Make texture with fill color::RMB: Display saved texture
btn_open_tex_erm=LMB: Открыть файловый браузер, чтобы выбрать, переименовать и изменить размер текстуры::RMB: Просмотреть файл в папке | LMB: Open file browser to select, rename and resize texture::RMB: View file in folder
edt_tex_erm_name=Название текстуры ERM, сгенерированное на основе имени объекта | ERM texture name generated from object name
color_normal=Цвет заливки для заглушки Normal, нейтральный: [128,128,255] | Normal color, neutral:[128,128,255]
btn_make_tex_normal=LMB: Создать текстуру с помощью цвета заливки::RMB: Отобразить сохраненную текстуру | LMB: Make texture with fill color::RMB: Display saved texture
btn_open_tex_normal=LMB: Открыть файловый браузер, чтобы выбрать, переименовать и изменить размер текстуры::RMB: Просмотреть файл в папке | LMB: Open file browser to select, rename and resize texture::RMB: View file in folder
edt_tex_normal_name=Название текстуры Normal, сгенерированное на основе имени объекта | Normal texture name generated from object name
edt_object_addr=
btn_check_copy=Скопировать имя в буфер обмена из адресной строки | Copy name to Clipboard from adress-line
btn_check_paste=Вставить имя из буфера обмена в адресную строку | Paste name from Clipboard to adress-line
btn_check_names=Проверить адрес на соответствие правилам и показать ошибки, рекомендации к исправлению | Check adress with rules and show errors and recomendations
btn_Streets_List=Создать новый диалог со списком московских улиц для выбора улицы или названия из списка | Create new dialog with Moscow streets list to select from
btn_multimat_table=Создать диалоговое окно с превью текстур и разверток для поиска ошибок с текстурами и UDIM | Create Dialog to findout mistakes with textures and UDIMs
btn_alpha_remove=Создать диалоговое окно со списком текстур и их параметрами для поиска ошибок с альфа-каналом и глубиной текстур в битах | Create Dialog to findout mistakes with alpha-channel and bit-depth of textures
btn_count_colors=Создать диалоговое окно со списком текстур и их параметрами для поиска ошибок с количеством цветов в текстурах | Create Dialog to findout mistakes with colors quantity of textures
btn_count_texel=Создать диалоговое окно для работы с плотностями текселей выбранного объекта | Create Dialog to work with texels densities of selected object
btn_count_area=Создать диалоговое окно для работы над ошибками полигонов выбранного объекта | Create Dialog to work with polygons errors of selected object
btn_ids_as_udims=LMB: Установить ID для всех островов в соответствии с номером UDIMs, это необходимо для создания Multimat::LMB+CTRL: Другой метод | Set IDs to all islands according to UDIMs number, need for Multimat::LMB+CTRL: Alternate method
btn_udims_as_ids=LMB: Разместить все острова по UDIMS согласно их ID::LMB+CTRL: не масштабировать, а только разложить без смещения | LMB: Fits all islands in UDIMS by IDs::LMB+CTRL: Do not rescale, but only place without offset
spn_bricks_unwrap_sc2=Масштабировать UDIM до значения [0-1] | Scale to UDIM value [0-1]
btn_render_mat=LMB: Отрендерить каналы VIZ Multimaterial выбранного объекта в текстуры и сохранить по текущему пути::::RMB: Отрендерить VIZ Multimaterial выбранного объекта в UDIM текстуры, собрать из них Diffuse, Normal, ERM и сохранить по текущему пути | LMB: Render channels of VIZ Multimaterial of selected object to textures and put to current path::::RMB: Render VIZ Multimaterial of selected object to UDIM textures, make Diffuse, Normal, ERM and put to current path
btn_Condense=LMB: Сократить Multimaterial до числа используемых в объекте ID, создает новые объект и материал. После можно нажать кнопку IDs to UDIMS | LMB: Condense MultiMaterial and Object's IDs, makes new object and material. After press IDs to UDIMS
btn_id_roll=LMB: Сдвинуть ID в объекте на указанное число, обычно требуется освободить первый ID для процедуры рендеринга в текстуру | LMB: Rolls IDs of object to specified number, usually need to free first ID for Render To Texture Procedure
spn_id_roll=
btn_editor=LMB: Создать диалоговое окно для создания текстур Opacity и ERM::RMB: Создать диалоговое окно для редактирования текстур под развертку UVW и смешивания текстур | LMB: Create Dialog for creation Opacity and ERM textures::RMB: Create Dialog to Edit textures and UVWs
btn_bricks_unwrap_pressed=
btn_bricks_unwrap_rightclick=
btn_bricks_unwrap=LMB: Собрать все части развертки в один UDIM, работает c отдельными лоскутами развертки, можно использовать разные методы или полностью автоматически::RMB: Собрать развертку скоростным методом, используя текущее выделение граней | LMB: Unwrap Tiles to one UDIM, may work with different methods or fully automatical::RMB: Make packing with speed method, use current FACES selection
btn_poly_to_edges_selector=LMB: Перенос выделенных FACES на параллельные EDGES из EDITABLE POLY в новый модификатор UVW UNWRAP, который необходим для разбивки ребер на тексельные острова::LMB+CTRL: Перенос выделенных FACES на EDGES с триангулированным объектом | LMB: Transfer selected FACES to parallel EDGES from EDITABLE POLY to new UVW UNWRAP modifier, need for breaking edges for texels islands.::LMB+CTRL: Transfer selected FACES to EDGES with triangulated object
btn_bricks_flatten=Свести все лоскуты развертки к нулю по оси W | Flatten UVW texels to zero in W-Axiz
btn_bricks_unwrap_new=LMB: Собрать все части развертки в один UDIM, работает с островами развертки::LMB+CTRL: Собрать развертку с выделением ребер в триангулированной модели::RMB: Собрать развертку скоростным методом, используя текущее выделение ребер::Выбрать EDGES ребра или-и FACES и нажмите кнопку | LMB: Make Landscape Unwrap packing to UDIM with selection of parallel edges::LMB+CTRL: Make packing with EDGES selection in triangulated model::RMB: Make packing with speed method, use current edges selection::Select EDGES or-and FACES and press button
btn_edges_selector=LMB: Выбрать параллельные ребра в EDITABLE POLY объекте, нужно когда выделение потеряно после Slice::RMB: Выбрать 'правильные' ребра в триангулированном EDITABLE POLY объекте | LMB: Select parallel edges in EDITABLE POLY object, need if lost selection after Slice modifiers::RMB: Select 'good' edges in triangulated EDITABLE POLY object
btn_transfer_edges=Трансфер выбранных ребер из EDITABLE POLY в новый модификатор развертки UVW UNWRAP, необходимо для разделения ребер у тексельных островов | Transfer selected EDGES from EDITABLE POLY to new UVW UNWRAP modifier, need for breaking edges for texels islands
btn_bricks_unwrap_get_num=Выбрать один тексель из выделения, этот тексель будет основным для разбивки других текселей, он должен быть выше и шире, чем любой другой | Get single texel from selection, this texel will be main to tile other texels, it should be higher and wider than anyone
spn_bricks_unwrap_num=Выбранный тексель для укладки | To be selected texel for tiling
rdo_unwrap_method=Использовать для перемещения углы текселей ul: верх-левый, ur: верх-правый, dl: вниз-левый, dr: вниз-правый::Center: перемещать центры островов к центрам UDIM::Integers: перемещать округленное положение островов к центрам UDIM | Corners, ul: up-left, ur: up-right, dl: down-left, dr: down-right.::Tiles using corners by maximum dimension of texel island, usually produce better results of tiling small parts::Centers: Tiles by moving via centers of islands to centers of UDIMs::Integers: Tiles by moving via centers of islands by integer parts in UDIMs
btn_bricks_unwrap_get_island=Выбрать остров текселей из выделенных, этот остров будет основным для укладки других текселей, он должен быть выше и шире всех остальных | Get texels island from selection, this island will be main to tile other texels, it should be higher and wider than anyone
lbl_bricks_unwrap_get_island=Выбранные тексели EDITABLE POLY для укладки | To be selected texels or polys for tiling
chk_bricks_unwrap_treshold=Использовать порог для размещения текселей | Use treshhold for placing texels
spn_bricks_unwrap_treshold=
chk_unwrap_texel_or_poly=Искать тексель (или остров) с максимальными размерами, необходимо для определения масштаба | Find texel (or texels island) with maximum dimensions, need to findout Scale
chk_bricks_unwrap_unfold=Сделать новую развертку для всех текселей вместо использования существующей развертки | Use new UNFOLD to all texels instead of using existing mapping
chk_bricks_unwrap_pack=Ставить сначала основной тексель\остров как можно ближе в UDIM, это приблизит другие тексели\острова, но уничтожит начальное смещение в текстуре | Set main texel\island to UDIM as much close as possible, this will pack closer other texels\islands, but destroy initial offset in texture
chk_bricks_unwrap_scale=Использовать масштабирование текселей, чтобы вписать их в UDIM целиком; уничтожает начальное смещение в текстуре | Use scale texels to fit in UDIMs,::destroys initial offset in texture
chk_bricks_unwrap_width=Использовать ширину для изменения масштаба текселей | Use width to rescale texels to fit in UDIMs
chk_bricks_unwrap_height=Использовать высоту для изменения масштаба текселей | Use height to rescale texels to fit in UDIMs
chk_bricks_unwrap_redo=Переместить в конце пропущенные тексели в первый UDIM | After all job done, try to move missed texels to first UDIM
chk_bricks_unwrap_cut=Автоматическая нарезка объекта по сетке для каждого UDIM, метод №1. Использует POLY срезы, автор Фридрих Ханиш, friedrich@3d-io.com::Убедитесь, что у вас есть UV-острова размером более одного UDIM | Auto Slice object for every UDIM Grid of UV texels, Method #1: uses Poly Slices, by Friedrich Hanisch, friedrich@3d-io.com::Be sure you have UV islands larger than one UDIM
chk_bricks_unwrap_cut2=Автоматическая нарезка объекта по сетке для каждого UDIM, метод №2. Убедитесь, что у вас нет развертки в координате W у UVW, не делает разрез вдоль W координаты. Убедитесь, что у вас есть UV-острова размером более одного UDIM. Необходимо удалить плохие вершины и выполнить сварку вершин | Auto Slice object for every UDIM Grid of UV texels, Method #2::Be sure, you do not have unwrap in W coordinate of UVW, its do not cut along W.::Be sure you have UV islands larger than one UDIM::You should after Remove bad Verts and do Vertex Weld
chk_bricks_unwrap_rescale=Изменить масштаб выбранных текселей до целевой плотности текселя (см. ниже), уничтожив начальное смещение в текстуре | Also Rescale selected texels to Target Texels Density (see lower), destroys initial offset in texture
chk_bricks_unwrap_undo=Отключить буфер отмены во время работы для экономии памяти. Можно удалить модификатор Unwrap UVW, чтобы отменить результат | Turn Undo buffer Off during operation for memory saving. Delete Unwrap UVW modifier to undo result
btn_Udim_Rescale=LMB: Масштабирование до целевой плотности текселей: взять среднее значение из всех плотностей выделенных текселей и отмасштабировать UV-развертку до целевой плотности текселей::Подробнее см. в меню Texels Density UDIMs | LMB: Rescale UV unwrap to target texels density: take a middle value of all densities of selection and rescales UV unwrap to target texels density::See more in dialog: Texels Density UDIMs
ddl_texture_Rescale_size=Размеры текстуры:::256*256 пикселей,::512*512 пикселей,::1024*1024 пикселей,::допустимое значение: 2048*2048 пикселей,::допустимое значение: 4096*4096 пикселей | Texture dimensions:::256*256 pixels,::512*512 pixels,::1024*1024 pixels,::valid: 2048*2048 pixels,::valid: 4096*4096 pixels
spn_Udim_Rescale_Density=Целевое значение плотности текселей [512..1706] | Target texels density value [512..1706]
btn_unwrap_windows=Развернуть все окна в один UDIM с одинаковой плотностью текселей::Лучший результат при ручном повороте на параллельную ось | Unwrap all windows to single UDIM with equal texel density::Better result with manual rotation to parallel axis
spn_unwrap_windows=Расстояние для поиска оконных стекол, стекла ближе указанного расстояния, обрабатываются как кластер | Distance range to search windows glasses, near distance treats as single cluster
spn_unwrap_windows_rotation_acc=Точность шага вращения | Accuracy of rotation step
chk_unwrap_windows_rotation=Повернуть UVW карту к окну | Rotate UVW map to window
chk_unwrap_windows_align=Выровнить UVW карту к окну | Align UVW map to window
chk_unwrap_windows_flatten=Сгладить развертку UVW по оси W | Flatten UVW in W-axis
ddl_size_atlas=Размер текстуры для низкополигонального атласа: подходящие размеры - 256, 512, 1024, 2048, а 4096 только для тестирования | Texture size for lowpoly atlas:::good - 256, 512, 1024, 2048::for testing only - 4096
btn_unwrap_lowpoly_from_material=LMB: Собрать все текстуры и развертки выбранных объектов в общий атлас НПМ. Предварительно можно нажать Multisub HP::LMB+CTRL: Большие заглушки::LMB+ALT: Масштабировать в диапазон плотности [10..40]::LMB+Shift: Фильтрация Lancos | LMB: Collect all textures from selected objects and all UDIMs to 5 Lowpoly Atlases::May press Render Material or Multisub HP before::LMB+CTRL: Large 256x256 textures::LMB+ALT: Fit densites range [10..40]::LMB+Shift: Use Lancos resize filter
btn_MakeLowpolyPlant=Сделать низкополигональное дерево из высокополигонального дерева | Make lowpoly tree from highpoly tree	
btn_UdimLeft=Переместить выделенные тексели в ЛЕВЫЙ UDIM | Move selected texels to LEFT UDIM
btn_UdimRight=Переместить выделенные тексели в ПРАВЫЙ UDIM | Move selected texels to RIGHT UDIM
btn_UdimUp=Переместить выделенные тексели в ВЕРХНИЙ UDIM | Move selected texels to UP UDIM
btn_UdimDown=Переместить выделенные тексели в НИЖНИЙ UDIM | Move selected texels to DOWN UDIM
btn_UdimRotate=LMB: Повернуть остров и ориентировать его вертикально по самому длинному краю::LMB+CTRL: по второму по длине краю, полезно при триангуляции::LMB+ALT: ориентировать горизонтально | LMB: Rotate island and orient it vertical by longest edge::LMB+CTRL: by second longest edge, useful if triangulated::LMB+ALT: orient horizontal
btn_UdimMove=LMB: Переместить выделенные тексели в центр первого UDIM::LMB+ALT: Переместить выделенные тексели островами::LMB+CTRL: Переместить выделенные тексели по отдельности с разрывом::RMB: Разложить выделенные острова со смещением по UDIM | LMB: Move selected texels to first's UDIM center::LMB+ALT: Move selected texels by islands::LMB+CTRL: Move selected texels individualy with break::RMB: Arrange the selected islands with an offsets in UDIM
btn_UdimScale=LMB: Найти масштаб относительно размера UDIM по самому большому выделенному текселю, отмасштабировать выбранные тексели::LMB+CTRL: Масштабировать выбранные острова как самый большой остров::LMB+ALT: Масштабировать отдельные острова, чтобы они соответствовали друг другу::LMB+CTRL+ALT: Масштабировать все выбранные острова до размера самого большого острова | LMB: Find Scale relative to UDIM size from largest texel of selection, Scale selected texels.::LMB+CTRL: Scale selected as largest island::LMB+ALT: Scale selected individual by islands to fit each other::LMB+CTRL+ALT: Scale all selected to size of largest island
spn_bricks_unwrap_sc=Масштабировать UDIM до значения [0-1] | Scale to UDIM value [0-1]
btn_UdimFit=LMB: Вместить выбранные тексели в первый UDIM::LMB+CTRL: Вместить в ближайший UDIM::LMB+ALT: Вместить все карты в текущем ID материала::Отметить Tex\Mat, чтобы подогнать текстуру\материал::::RMB: Подогнать текстуру к UV острову | LMB: Fit selected texels to first UDIM::LMB+CTRL: Fit to UDIM with center of selection::LMB+ALT: Fits all textures in current Mat ID::::Check Texture\Material to also FIT Texture or Material::::RMB: Fit texture to UV island
chk_UdimFit=После подгонки, также изменить масштаб текстуры или всех текстур в материале для этого UDIM | After FITing Texels to UDIM, also rescale Texture\All Textures in Material for this UDIM
btn_UdimFitMat=LMB: Вместить выбранные тексели в ближайшие к ним UDIMы с учетом множителя отступа согласно ID, переразмерить все текстуры в мультиматериале под развертку по ID | LMB: Fit the selected texels into the nearest UDIMs with offset multiplier according IDs, and resize all textures in the Multimaterial according to IDs::LMB+CTRL: collect all IDs in the first UDIM

